/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: snam <snam@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/08 15:00:13 by snam              #+#    #+#             */
/*   Updated: 2021/05/08 15:00:33 by snam             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

char	*ft_strchr(const char *str, int c)
{
	while (*str)
	{
		if (*str == c)
			return (str);
		str++;
	}
	if (c == 0)
		return (str);
	return (0);
}

/*
src에서 특정 문자를 검색하는 함수

str : 검색을 하려는 문자열
c : 검색할 문자

char * : 
문자가 존재하면 해당 문자가 존재하는 곳의 포인터를 반환, 
존재하지 않으면 NULL 반환
*/
