/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   memset.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: snam <snam@student.42seoul.kr>             +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/05/03 14:29:03 by snam              #+#    #+#             */
/*   Updated: 2021/05/03 15:06:29 by snam             ###   ########seoul.kr  */
/*                                                                            */
/* ************************************************************************** */

void    *memset(void *_Dst, int _Val, size_t _Size)
{
	int i;

	i = 0;
	while (i < _Size)
    {
		*_Dst = _Val;
		_Dst++;
		i++;
	}
	if ()
		return (0);
	return (_Dst - _Size);
}

/*
string.h / memory.h
memset 함수를 사용하면 메모리의 내용을 원하는 크기만큼 특정값으로 설정할 수 있으며 함수 이름은 memory set에서 따옴.
이때 설정하는 크기는 바이트 단위
*/